# Row Selection

Row Selection adalah teknik mengambil baris yang diinginkan. Pengambilan baris dapat menggunakan logika ataupun method.

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

## Persiapan Dataframe

In [9]:
n_rows = 10
n_columns = 5
cols = tuple("ABCDE")

df = pd.DataFrame(np.random.randint(1,5, size = (n_rows,n_columns)),
                 columns = cols)
df

   A  B  C  D  E
0  1  4  2  2  3
1  3  3  4  2  3
2  2  3  1  2  1
3  2  3  2  2  4
4  3  1  2  2  2
5  1  4  4  4  4
6  2  1  4  2  2
7  3  1  2  4  2
8  2  3  1  2  4
9  2  1  3  2  3

## Row Selection dengan operator | = "Atau"

In [12]:
df[(df["A"]==1) | (df["A"]==3)] #me-return baris yang merupakan kolom A dengan nilai 1 atau 3

   A  B  C  D  E
0  1  4  2  2  3
1  3  3  4  2  3
4  3  1  2  2  2
5  1  4  4  4  4
7  3  1  2  4  2

## Row Selection dengan operator &

In [13]:
df[(df["A"]==1) & (df["C"]==2)] #me-return baris yang merupakan kolom A dengan nilai 1 dan kolom C bernilai 2

   A  B  C  D  E
0  1  4  2  2  3

## Row Selection dengan method .isin()

In [16]:
df[df["A"].isin((1,3))]

   A  B  C  D  E
0  1  4  2  2  3
1  3  3  4  2  3
4  3  1  2  2  2
5  1  4  4  4  4
7  3  1  2  4  2

## Row Selection dengan operator ~

In [18]:
 df[~df["A"].isin((1,3))]

   A  B  C  D  E
2  2  3  1  2  1
3  2  3  2  2  4
6  2  1  4  2  2
8  2  3  1  2  4
9  2  1  3  2  3

# PR !

Buatlah dataframe berukuran 20x7 berisi bilangan acak normal dan pilihlah nilai yang kurang dari 50% dan dikali 100 lebih dari 20%

Referensi

https://www.youtube.com/watch?v=GPh8sBGp0FM&list=PL2O3HdJI4voGJg3hYGR5kfBxXv90DJ1lU&index=3